v = int(input('введіть швидкість:'))
t = int(input('введіть час :'))
s = v * t
if v >= 0 and 0 <= t <= 10 and 0 <= s <= 100:     # швидкість, час і відстань в межах виконання задачі
    print(f"Пройдений шлях = {s} км")
elif v < 0 and t >= 0:                            # швидкість від'ємна
    print ("Рухається в негативному напрямку")
elif v >= 0 and t >= 0 and s > 100:               # Пройдений шлях перевищує умову задачі
    print("Подолав задану відстань")
else:
    print("введені помилкові дані")